# YOLOv8-CBAM 改进版模型配置文件
# 学生学号：55230316
# 改进：在 backbone 和 head 中添加 CBAM 注意力机制

nc: 80

scales:
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

# YOLOv8n backbone with CBAM
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]              # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]             # 1-P2/4
  - [-1, 3, C2f, [128, True]]              # 2
  - [-1, 1, Conv, [256, 3, 2]]             # 3-P3/8
  - [-1, 6, C2f, [256, True]]              # 4
  - [-1, 1, CBAM, [7]]                     # 5 【改进点 1】P3 特征增强
  - [-1, 1, Conv, [512, 3, 2]]             # 6-P4/16
  - [-1, 6, C2f, [512, True]]              # 7
  - [-1, 1, CBAM, [7]]                     # 8 【改进点 2】P4 特征增强
  - [-1, 1, Conv, [1024, 3, 2]]            # 9-P5/32
  - [-1, 3, C2f, [1024, True]]             # 10
  - [-1, 1, CBAM, [7]]                     # 11 【改进点 3】P5 特征增强
  - [-1, 1, SPPF, [1024, 5]]               # 12

# YOLOv8n head with CBAM
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 13
  - [[-1, 8], 1, Concat, [1]]                   # 14: cat backbone P4 (512 通道)
  - [-1, 3, C2f, [512]]                         # 15

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 16
  - [[-1, 5], 1, Concat, [1]]                   # 17: cat backbone P3 (256 通道)
  - [-1, 3, C2f, [256]]                         # 18
  - [-1, 1, CBAM, [7]]                          # 19 【改进点 4】Head P3 特征增强

  - [-1, 1, Conv, [256, 3, 2]]                  # 20
  - [[-1, 15], 1, Concat, [1]]                  # 21: cat head P4 (512 通道)
  - [-1, 3, C2f, [512]]                         # 22
  - [-1, 1, CBAM, [7]]                          # 23 【改进点 5】Head P4 特征增强

  - [-1, 1, Conv, [512, 3, 2]]                  # 24
  - [[-1, 12], 1, Concat, [1]]                  # 25: cat head P5 (1024 通道)
  - [-1, 3, C2f, [1024]]                        # 26

  - [[19, 23, 26], 1, Detect, [nc]]             # 27: Detect(P3, P4, P5)
