# YOLOv8-CBAM 改进版模型配置文件
# 学生学号：55230316
# 改进：在 backbone 和 head 中添加 CBAM 注意力机制

nc: 80

scales:
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, CBAM, [7]]                    # 【改进点 1】P3 输出添加 CBAM
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, CBAM, [7]]                    # 【改进点 2】P4 输出添加 CBAM
  - [-1, 1, Conv, [512, 3, 2]]
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, CBAM, [7]]                    # 【改进点 3】P5 输出添加 CBAM
  - [-1, 1, SPPF, [1024, 5]]

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 3, C2f, [512]]

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 3, C2f, [256]]                   # 15 (P3/8-small)
  - [-1, 1, CBAM, [7]]                    # 【改进点 4】Head P3 添加 CBAM

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 12], 1, Concat, [1]]
  - [-1, 3, C2f, [512]]                   # 19 (P4/16-medium)
  - [-1, 1, CBAM, [7]]                    # 【改进点 5】Head P4 添加 CBAM

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 9], 1, Concat, [1]]
  - [-1, 3, C2f, [1024]]                  # 23 (P5/32-large)

  - [[16, 20, 23], 1, Detect, [nc]]       # Detect(P3, P4, P5)
