# ============================================================================
# YOLO11-CBAM 改进版模型配置文件
# 学生学号：55230316
# 任务：个人任务一 - 算力环境部署与核心算法跑通
# 方向：计算机视觉 - 基于改进 YOLO11 的目标检测
#
# 改进说明：
# 1. 在 backbone 的 C3k2 模块后添加 CBAM 注意力机制
# 2. CBAM = Channel Attention + Spatial Attention
# 3. 作用：让模型更关注重要特征，抑制无关特征
#
# 参考文献：
# CBAM: Convolutional Block Attention Module (ECCV 2018)
# https://arxiv.org/abs/1807.06521
# ============================================================================

# Parameters
nc: 80 # number of classes

# Model scales - 为每个尺度添加 CBAM 配置
scales:
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024] # YOLO11n-CBAM
  s: [0.50, 0.50, 1024] # YOLO11s-CBAM
  m: [0.50, 1.00, 512]  # YOLO11m-CBAM
  l: [1.00, 1.00, 512]  # YOLO11l-CBAM
  x: [1.00, 1.50, 512]  # YOLO11x-CBAM

# YOLO11 backbone with CBAM
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]              # 0-P1/2: 初始下采样
  - [-1, 1, Conv, [128, 3, 2]]             # 1-P2/4: 第二次下采样
  - [-1, 2, C3k2, [256, False, 0.25]]      # 2: 特征提取
  - [-1, 1, CBAM, [256]]                   # 3-CBAM: 【改进点 1】在 P3 输出添加 CBAM
  - [-1, 1, Conv, [256, 3, 2]]             # 4-P3/8: 下采样到 P3
  - [-1, 2, C3k2, [512, False, 0.25]]      # 5: 特征提取
  - [-1, 1, CBAM, [512]]                   # 6-CBAM: 【改进点 2】在 P4 输出添加 CBAM
  - [-1, 1, Conv, [512, 3, 2]]             # 7-P4/16: 下采样到 P4
  - [-1, 2, C3k2, [512, True]]             # 8: 特征提取（使用 True 表示使用更多注意力）
  - [-1, 1, Conv, [1024, 3, 2]]            # 9-P5/32: 下采样到 P5
  - [-1, 2, C3k2, [1024, True]]            # 10: 深层特征提取
  - [-1, 1, CBAM, [1024]]                  # 11-CBAM: 【改进点 3】在 P5 输出添加 CBAM
  - [-1, 1, SPPF, [1024, 5]]               # 12: SPPF 空间金字塔池化
  - [-1, 2, C2PSA, [1024]]                 # 13: PSA 注意力模块（原有）

# YOLO11 head with CBAM
head:
  # 上采样和特征融合
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 8], 1, Concat, [1]]              # cat backbone P4
  - [-1, 2, C3k2, [512, False]]            # 17

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 5], 1, Concat, [1]]              # cat backbone P3
  - [-1, 2, C3k2, [256, False]]            # 20 (P3/8-small)
  - [-1, 1, CBAM, [256]]                   # 21-CBAM: 【改进点 4】在 Head 的 P3 添加 CBAM

  # P4 路径
  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 17], 1, Concat, [1]]             # cat head P4
  - [-1, 2, C3k2, [512, False]]            # 24 (P4/16-medium)
  - [-1, 1, CBAM, [512]]                   # 25-CBAM: 【改进点 5】在 Head 的 P4 添加 CBAM

  # P5 路径
  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 13], 1, Concat, [1]]             # cat head P5
  - [-1, 2, C3k2, [1024, True]]            # 28 (P5/32-large)

  # Detect 头
  - [[21, 25, 28], 1, Detect, [nc]]        # Detect(P3, P4, P5)
